In [1017]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as stats
import seaborn as sns
from pydataset import data
import env

For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

- Has the network latency gone up since we switched internet service providers?
- Is the website redesign any good?
- Is our television ad driving more sales?

#### Has the network latency gone up since we switched internet service providers?
$H_{0}$ :  Service providers has no effect on network latency

$H_{a}$ : Service providers has effect on network latency

True Positive: we rejected Null Hypothesis, new service provider's clogged network on busy hours. 

True Negative: We failed to reject Null Hypothesis, playing 4k games increases network latency

type I: We rejected Null Hypothesis, slow computer causes increase on network latency

type II: We failed to reject Null Hypothesis, service provider's internet speed is slower than other service provider's internet speed.

#### Is the website redesign any good?
$H_{0}$ : website redesign is not good

$H_{a}$ : website redesign is good

True Positive: we rejected Null Hypothesis, website redsegin voted best by consumers

True Negative: we failed to reject Null Hypothesis, website redsegin voted worst by consumers

Type I: we rejected Null Hypothesis, number users visitng website decreases because of bad redesign

Type II: we failed to reject Null Hypothesis, high number of users said that website redesign is good

#### Is our television ad driving more sales?
$H_{0}$ : television ad is not increasing sales

$H_{a}$ : television ad increases sales

True Positive: we rejected Null Hypothesis, sales remain same after television ad

True Negative: we failed to reject Null Hypothesis, customers who haven't seen televsions ad increased sales

type I: we rejected  Null Hypothesis, sales decreases after televison ad

type II: we failed to reject Null Hypothesis, sales increases after television ad

#### Answer with the type of test you would use (assume normal distribution):

   - Is there a difference in grades of students on the second floor compared to grades of all students?
    
   - Are adults who drink milk taller than adults who dont drink milk?
     
   - Is the the price of gas higher in texas or in new mexico?    
    
   - Are there differences in stress levels between students who take data science vs students who take web development vs students who take cloud academy?

2-tail One Sample T-Test

1-tail Independent T-Test

1-tail Independent T-Test, greater than

ANOVA Analysis of Variance

####  3. Load the mpg dataset and use it to answer the following questions:

    - Is there a difference in fuel-efficiency in cars from 2008 vs 1999? 
    
    - Are compact cars more fuel-efficient than the average car?
    
    - Do manual cars get better gas mileage than automatic cars?

In [1018]:
df = data('mpg')
df.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [1019]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [1020]:
df['fuel_efficiency'] = (df.cty + df.hwy)/2
df

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,fuel_efficiency
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5

###  Is there a difference in fuel-efficiency in cars from 2008 vs 1999?

In [1021]:
# Independent T-Test 2_tail, significantly different

### Hypothesis
$H_{0}$ : cars from 2008 and 1999 has no difference in fuel-efficiency

$H_{a}$ : cars from 2008 and 1999 has difference in fuel- efficiency

### Significane Level
Alpha set to 0.05

In [1022]:
year_1999 = df[df.year == 1999].fuel_efficiency
year_2008 = df[df.year == 2008].fuel_efficiency

In [1023]:
alpha = 0.05

### Verify assumptions

- Independent sample
- Normal Distribution, or at least 30 observations
- Equal Variance

In [1024]:
df.year.value_counts()

1999    117
2008    117
Name: year, dtype: int64

In [1025]:
print(year_1999.var())
print(year_2008.var())

27.122605363984682
24.097480106100797

### Compute test statistic and probability (t-statistic & p-value)

In [1026]:
t, p = stats.ttest_ind(year_1999, year_2008, equal_var=False)
t, p

(0.21960177245940962, 0.8263750772060638)

### Decide:
    
- p-value < alpha

In [1027]:
# Is there a difference in fuel-efficiency in cars from 2008 vs 1999?

if p < alpha:
    print('Reject $H_{0}$')
else: 
    print('Fail to reject $H_{0}$ ')

Fail to reject $H_{0}$

### Conclusion: 
We failed to reject the Null Hypothesis, there is no significant difference in fuel effficiency between cars made in 1999 and 2008

#### Are compact cars more fuel-efficient than the average car?

In [1028]:
# One Sample T-Test 1-tail, significantly larger

### Hypothesis
$H_{0}$ :compact cars are not fuel-effiecient than average car

$H_{a}$ : compact cars are more fuel-effiecient than of all car

### Significane Level
Alpha set to 0.05

In [1029]:
alpha = 0.05

### Verify Assumptions

- Normal Distribution, or at least 30 observations

In [1030]:
df['class'].value_counts()

suv           62
compact       47
midsize       41
subcompact    35
pickup        33
minivan       11
2seater        5
Name: class, dtype: int64

In [1031]:
compact_sample = df[df['class'] == 'compact'].fuel_efficiency
overall_mean = df.fuel_efficiency.mean()
overall_mean

20.14957264957265

### Compute test statistic and probability (t-statistic & p-value)

In [1032]:
t, p = stats.ttest_1samp(compact_sample, overall_mean)
t, p/2

(7.896888573132533, 2.0992818971585743e-10)

### Decide

- p/2 < alpha and t > 0

In [1033]:
# Are compact cars more fuel-efficient than the average car?

if p/2 > alpha:
    print("We fail to reject $H_{0}$")
elif t < 0:
    print("We fail to reject $H_{0}$")
else:
    print("We reject $H_{0}$")

We reject $H_{0}$

### Conclusion: 
We rejected the Null Hypothesis, compact cars are more efficient than the average car

###  Do manual cars get better gas mileage than automatic cars?

In [1034]:
# Independent T-Test 1 tail, significantly larger

### Hypothesis

$𝐻_{0}$  : manual cars are not more fuel-efficient than automatic cars

$𝐻_{𝑎}$  : manual cars are more fuel-efficient than automatic cars

###  Significane Level

Alpha set to 0.05

In [1035]:
alpha = 0.05

In [1036]:
df.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,fuel_efficiency
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [1037]:
manual_sample = df[df.trans.str.startswith('m')].fuel_efficiency
auto_sample =df[df.trans.str.startswith('a')].fuel_efficiency

In [1038]:
manual_sample.mean()

22.227272727272727

In [1039]:
auto_sample.mean()

19.130573248407643

### Verify assumptions

- Independent sample
- Normal Distribution, or at least 30 observations
- Equal Variance

In [1040]:
df.trans.value_counts()

auto(l4)      83
manual(m5)    58
auto(l5)      39
manual(m6)    19
auto(s6)      16
auto(l6)       6
auto(av)       5
auto(s5)       3
auto(s4)       3
auto(l3)       2
Name: trans, dtype: int64

In [1041]:
manual_sample.var()

26.635167464114826

In [1042]:
auto_sample.var()

21.942777233382337

In [1043]:
# check variance 

t, p = stats.levene(manual_sample, auto_sample)
t, p/2

(0.20075824847529639, 0.32726381775659286)

### Compute test statistic and probability (t-statistic & p-value)

In [1044]:
t, p = stats.ttest_ind(manual_sample, auto_sample, equal_var=False)
t, p / 2

(4.443514012903072, 8.976124499958947e-06)

### Decide

- p/2 < alpha and t > 0

In [1045]:
#Do manual cars get better gas mileage than automatic cars?

if p / 2 > alpha:
    print("We fail to reject $H_{0}$")
elif t < 0:
    print("We fail to reject $H_{0}$")
else:
    print("We reject $H_{0}$")

    
# another way

# if t > 0 and (p/2) < alpha:
#     print("We reject $H_{0}$")
# else:
#     print("We fail to reject $H_{0}$")

We reject $H_{0}$

### Conclusion:
We rejected the Null Hypothesis, manual cars are more fuel-efficient than automatic car

------------

1. Answer with the type of stats test you would use (assume normal distribution):

- Is there a relationship between the length of your arm and the length of your foot?
- Do guys and gals quit their jobs at the same rate?
- Does the length of time of the lecture correlate with a students grade?

In [1046]:
from pydataset import data
import env

2. Use the telco_churn data.
- Does tenure correlate with monthly charges?
- Total charges?
- What happens if you control for phone and internet service?

In [1047]:
url = f'mysql+pymysql://{username}:{password}@{host}/telco_churn'
df1 = pd.read_sql('SELECT * FROM customers', url)
df1.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,1,No,...,No,Yes,Yes,No,2,Yes,2,65.6,593.3,No
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,No,No,No,Yes,1,No,2,59.9,542.4,No
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,2,No,...,Yes,No,No,No,1,Yes,1,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,2,No,...,Yes,No,Yes,Yes,1,Yes,1,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,2,No,...,No,Yes,Yes,No,1,Yes,2,83.9,267.4,Yes

In [1048]:
# check for data types

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               7043 non-null   object
 1   gender                    7043 non-null   object
 2   senior_citizen            7043 non-null   int64
 3   partner                   7043 non-null   object
 4   dependents                7043 non-null   object
 5   tenure                    7043 non-null   int64
 6   phone_service             7043 non-null   object
 7   multiple_lines            7043 non-null   object
 8   internet_service_type_id  7043 non-null   int64
 9   online_security           7043 non-null   object
 10  online_backup             7043 non-null   object
 11  device_protection         7043 non-null   object
 12  tech_support              7043 non-null   object
 13  streaming_tv              7043 non-null   object
 14  streaming_movies          7043 non-null   object
 15  contract_type_id          7043 non-null   int64
 16  paperless_billing         7043 non-null   object
 17  payment_type_id           7043 non-null   int64
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
dtypes: float64(1), int64(5), object(15)
memory usage: 1.1+ MB

### Hypothesis

$H_0$ - no linear relationship between tenure and monthly charges

$H_a$ - there is linear relationship between tenure and monthly charges

In [1049]:
# the pearson' s r and p-value

r, p = stats.pearsonr(df1.tenure, df1.monthly_charges)
r, p

(0.24789985628615246, 4.094044991483017e-99)

In [1050]:
alpha = 0.05

In [1051]:
# compare p-value

if p < alpha: 
    print('Reject $H_{0}$' )
else:
    print('Fail to rejext $H_{0}$')

Reject $H_{0}$

### Conclusion:
We rejected the Null Hypothesis, there is a linear relationship between tenure and monthly charges

### Hypothesis¶
𝐻0  - no linear relationship between tenure and total charges

𝐻𝑎  - there is linear relationship between tenure and total charges

In [1052]:
df1.total_charges

0         593.3
1         542.4
2        280.85
3       1237.85
4         267.4
         ...
7038      742.9
7039     1873.7
7040      92.75
7041    4627.65
7042     3707.6
Name: total_charges, Length: 7043, dtype: object

In [1053]:
# df1.total_charges = df1.total_charges.astype(float)

In [1054]:
# find index causing ValueError: could not convert string to float: ''

for i, item in enumerate(df1.total_charges):
    try:
        float(item)
    except ValueError:
        print(f"Error at {i}: {item}")

Error at 945:
Error at 1731:
Error at 1906:
Error at 2025:
Error at 2176:
Error at 2250:
Error at 2855:
Error at 3052:
Error at 3118:
Error at 4054:
Error at 5433:

In [1055]:
# find valus causing ValueError: could not convert string to float: ''

df1.total_charges[945]

' '

In [1056]:
# convert string to Float even those causing errors

df1.total_charges= pd.to_numeric(df1.total_charges,errors='coerce')

In [1057]:
# check data types

df1.total_charges.dtypes

dtype('float64')

In [1058]:
# convert NAN to zeros

df1.total_charges = df1.total_charges.fillna(0)

In [1059]:
# Check if NAN is converted to zero

df1.total_charges[945]

0.0

In [1060]:
r, p = stats.pearsonr(df1.tenure, df1.total_charges)
r, p

(0.8261783979502481, 0.0)

In [1061]:
# compare p-value

if p < alpha: 
    print('Reject $H_{0}$' )
else:
    print('Fail to rejext $H_{0}$')

Reject $H_{0}$

### Conclusion:¶
We rejected the Null Hypothesis, there is a linear relationship between tenure and total charges

-----------------
What happens if you control for phone and internet service?

In [1062]:
df1.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,1,No,...,No,Yes,Yes,No,2,Yes,2,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,No,No,No,Yes,1,No,2,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,2,No,...,Yes,No,No,No,1,Yes,1,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,2,No,...,Yes,No,Yes,Yes,1,Yes,1,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,2,No,...,No,Yes,Yes,No,1,Yes,2,83.9,267.40,Yes

In [1063]:
df1.internet_service_type_id.unique()

array([1, 2, 3])

In [1064]:
df1.internet_service_type_id.dtype

dtype('int64')

In [1065]:
with_phone_service = df1[df1.phone_service == 'Yes']
without_phone_service = df1[df1.phone_service == 'No']
internet_service_DSL = df1[df1.internet_service_type_id == 1]
internet_service_Fiber_optic = df1[df1.internet_service_type_id == 2]
internet_service_None = df1[df1.internet_service_type_id == 3]

In [1066]:
r, p = stats.pearsonr(with_phone_service.tenure, with_phone_service.monthly_charges)
r, p

(0.24538898585363147, 7.117871077934896e-88)

In [1067]:
r, p = stats.pearsonr(without_phone_service.tenure, without_phone_service.monthly_charges)
r, p

(0.5857597986661369, 4.6033703473420516e-64)

In [1068]:
r, p = stats.pearsonr(internet_service_DSL.tenure, internet_service_DSL.monthly_charges)
r, p

(0.5172828196602499, 8.360426862271327e-166)

In [1069]:
r, p = stats.pearsonr(internet_service_Fiber_optic.tenure, internet_service_Fiber_optic.monthly_charges)
r, p

(0.6246206176175593, 0.0)

In [1070]:
r, p = stats.pearsonr(internet_service_None.tenure, internet_service_None.monthly_charges)
r, p

(0.34232562306194525, 3.356186955195866e-43)

In [1071]:
r, p = stats.pearsonr(with_phone_service.tenure, with_phone_service.total_charges)
r, p

(0.8301076972900466, 0.0)

In [1072]:
r, p = stats.pearsonr(without_phone_service.tenure, without_phone_service.total_charges)
r, p

(0.9535697728407466, 0.0)

In [1073]:
r, p = stats.pearsonr(internet_service_DSL.tenure, internet_service_DSL.total_charges)
r, p

(0.9413276892816262, 0.0)

In [1074]:
r, p = stats.pearsonr(internet_service_Fiber_optic.tenure, internet_service_Fiber_optic.total_charges)
r, p

(0.9853093528070621, 0.0)

In [1075]:
r, p = stats.pearsonr(internet_service_None.tenure, internet_service_None.total_charges)
r, p

(0.9815669784401064, 0.0)

3. Use the employees database.

- Is there a relationship between how long an employee has been with the company and their salary?
- Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [ ]:
querry_salary_title = """
    SELECT emp_no, s.salary, s.from_date, s.to_date, t.title
    FROM salaries s
    JOIN titles t USING(emp_no);
    """

In [1137]:
url = f'mysql+pymysql://{username}:{password}@{host}/employees'
df = pd.read_sql(querry_salary_title, url)

In [1153]:
df.head()

   emp_no  salary   from_date     to_date            title Salary_to_date
0   10001   60117  1986-06-26  1987-06-26  Senior Engineer     1987-06-26
1   10001   62102  1987-06-26  1988-06-25  Senior Engineer     1988-06-25
2   10001   66074  1988-06-25  1989-06-25  Senior Engineer     1989-06-25
3   10001   66596  1989-06-25  1990-06-25  Senior Engineer     1990-06-25
4   10001   66961  1990-06-25  1991-06-25  Senior Engineer     1991-06-25

In [1154]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4638507 entries, 0 to 4638506
Data columns (total 6 columns):
 #   Column          Dtype
---  ------          -----
 0   emp_no          int64
 1   salary          int64
 2   from_date       object
 3   to_date         object
 4   title           object
 5   Salary_to_date  object
dtypes: int64(2), object(4)
memory usage: 212.3+ MB

In [1138]:
df.shape

(4638507, 5)

In [1155]:
kk = df.groupby(['emp_no', 'salary'])
kk.head()

,emp_no,salary,from_date,to_date,title,Salary_to_date
0,10001,60117,1986-06-26,1987-06-26,Senior Engineer,1987-06-26
1,10001,62102,1987-06-26,1988-06-25,Senior Engineer,1988-06-25
2,10001,66074,1988-06-25,1989-06-25,Senior Engineer,1989-06-25
3,10001,66596,1989-06-25,1990-06-25,Senior Engineer,1990-06-25
4,10001,66961,1990-06-25,1991-06-25,Senior Engineer,1991-06-25
...,...,...,...,...,...,...
4638502,499999,63707,1997-11-30,1998-11-30,Engineer,1998-11-30
4638503,499999,67043,1998-11-30,1999-11-30,Engineer,1999-11-30
4638504,499999,70745,1999-11-30,2000-11-29,Engineer,2000-11-29
4638505,499999,74327,2000-11-29,2001-11-29,Engineer,2001-11-29
4638506,499999,77303,2001-11-29,9999-01-01,Engineer,9999-01-01

In [1149]:
import datetime

today_date = datetime.date.today()
today_date

today_date.year, today_date.month,today_date.day

# df.to_date.astype(str).str.replace('date.today', today_date)

(2022, 12, 5)

In [1156]:
df['Salary_to_date'] = df.to_date

In [1157]:
df['duration'] = df['to_date']- df['from_date']

In [1158]:
df.head()

,emp_no,salary,from_date,to_date,title,Salary_to_date,duration
0,10001,60117,1986-06-26,1987-06-26,Senior Engineer,1987-06-26,"365 days, 0:00:00"
1,10001,62102,1987-06-26,1988-06-25,Senior Engineer,1988-06-25,"365 days, 0:00:00"
2,10001,66074,1988-06-25,1989-06-25,Senior Engineer,1989-06-25,"365 days, 0:00:00"
3,10001,66596,1989-06-25,1990-06-25,Senior Engineer,1990-06-25,"365 days, 0:00:00"
4,10001,66961,1990-06-25,1991-06-25,Senior Engineer,1991-06-25,"365 days, 0:00:00"